tutorials/cases/Ideal_material_case_line/constant/heatTransferProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";    
    object      heatTransferProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

heatTransferModel constCONV;

Parameters
{
    h           2.0;    // era 5
    SAV         1e5;    // order of magnitudie from Wu2020
}

// ************************************************************************* //

